# coding=utf-8
# Задание 2

print('Общество в начале XXI века')
x = int(raw_input('Введите ваш возраст:'))
if 0 <= x <= 7:
    print('Вам в десткий сад!')
elif 7 <= x <= 18:
    print('Вам в школу!')
elif 18 <= x <= 25:
    print('Вам в профессиональное учебное заведение!')
elif 25 <= x <= 60:
    print('Вам на работу!')
elif 60 <= x <= 120:
    print('Вам на пенсию')
else:
    print('Ты не человек!')